const path: {
	x: number,
	y: number,
	z: number,
	quadraticPath?: any[],
	parkTo?: number
}[] = [
	{ x: 38.5, y: 0, z: 113.5 }, // 0 entrance bifurcation (입구 분기점)
	{
		x: 42.5,
		y: 0,
		z: 121,
		quadraticPath: [
			{ x: 38.5, y: 0, z: 113.5 },
			{ x: 38.5, y: 0, z: 121 },
			{ x: 42.5, y: 0, z: 121 },
		],
	}, // 1
	{ x: 47.5, y: 0, z: 121 }, // 2
	{
		x: 52.5,
		y: 0,
		z: 124,
		quadraticPath: [
			{ x: 47.5, y: 0, z: 121 },
			{ x: 52.5, y: 0, z: 121 },
			{ x: 52.5, y: 0, z: 124 },
		],
		parkTo: 56,
	}, // 3
	{
		x: 47.5,
		y: 0,
		z: 127,
		quadraticPath: [
			{ x: 52.5, y: 0, z: 124 },
			{ x: 52.5, y: 0, z: 127 },
			{ x: 47.5, y: 0, z: 127 },
		],
		parkTo: 55,
	}, // 4
	{
		x: 41.5,
		y: 0,
		z: 127,
		parkTo: 55,
	}, // 5
	{
		x: 36.5,
		y: 0,
		z: 127,
		parkTo: 54,
	}, // 6
	{
		x: 31,
		y: 0,
		z: 127,
		parkTo: 53,
	}, // 7
	{
		x: 26.5,
		y: 0,
		z: 127,
		parkTo: 52,
	}, // 8
	{
		x: 20,
		y: 0,
		z: 127,
		parkTo: 51,
	}, // 9
	{
		x: 14,
		y: 0,
		z: 121,
		quadraticPath: [
			{ x: 20, y: 0, z: 127 },
			{ x: 14, y: 0, z: 127 },
			{ x: 14, y: 0, z: 121 },
		],
		parkTo: 32,
	}, // 10
	{
		x: 14,
		y: 0,
		z: 114.5,
		parkTo: 31,
	}, // 11
	{
		x: 14,
		y: 0,
		z: 109,
		parkTo: 30,
	}, // 12
	{
		x: 14,
		y: 0,
		z: 102,
		parkTo: 29,
	}, // 13
	{
		x: 14,
		y: 0,
		z: 96,
		parkTo: 28,
	}, // 14
	{
		x: 14,
		y: 0,
		z: 89.5,
		parkTo: 27,
	}, // 15
	{
		x: 14,
		y: 0,
		z: 84.5,
		parkTo: 26,
	}, // 16
	{
		x: 14,
		y: 0,
		z: 80,
		parkTo: 25,
	}, // 17
	{
		x: 14,
		y: 0,
		z: 74.5,
		parkTo: 24,
	}, // 18
	{
		x: 14,
		y: 0,
		z: 69.5,
		parkTo: 23,
	}, // 19
	{
		x: 14,
		y: 0,
		z: 65,
		parkTo: 22,
	}, // 20
	{
		x: 14,
		y: 0,
		z: 59.5,
		parkTo: 21,
	}, // 21
	{
		x: 14,
		y: 0,
		z: 54.5,
		parkTo: 20,
	}, // 22
	{
		x: 14,
		y: 0,
		z: 50,
		parkTo: 19,
	}, // 23
	{
		x: 14,
		y: 0,
		z: 44.5,
		parkTo: 18,
	}, // 24
	{
		x: 14,
		y: 0,
		z: 39.5,
		parkTo: 17,
	}, // 25
	{
		x: 14,
		y: 0,
		z: 35,
		parkTo: 16,
	}, // 26
	{
		x: 14,
		y: 0,
		z: 29.5,
		parkTo: 15,
	}, // 27
	{
		x: 14,
		y: 0,
		z: 24.5,
		parkTo: 14,
	}, // 28
	{
		x: 14,
		y: 0,
		z: 19.5,
		parkTo: 13,
	}, // 29
	{
		x: 20,
		y: 0,
		z: 15,
		quadraticPath: [
			{ x: 14, y: 0, z: 19.5 },
			{ x: 14, y: 0, z: 15 },
			{ x: 20, y: 0, z: 15 },
		],
		parkTo: 2,
	}, // 30
	{
		x: 26.5,
		y: 0,
		z: 15,
		parkTo: 3,
	}, // 31
	{
		x: 31.5,
		y: 0,
		z: 15,
		parkTo: 4,
	}, // 32
	{
		x: 37.5,
		y: 0,
		z: 15,
		parkTo: 5,
	}, // 33
	{
		x: 43.5,
		y: 0,
		z: 19.5,
		quadraticPath: [
			{ x: 37.5, y: 0, z: 15 },
			{ x: 43.5, y: 0, z: 15 },
			{ x: 43.5, y: 0, z: 19.5 },
		],
		parkTo: 7,
	}, // 34
	{
		x: 43.5,
		y: 0,
		z: 24.5,
	}, // 35
	{
		// 36 exit bifurcation (출구 분기점) 출구 좌표 { x: 38.5, y: 41.5 }
		x: 38.5,
		y: 0,
		z: 29.5,
		quadraticPath: [
			{ x: 43.5, y: 0, z: 24.5 },
			{ x: 43.5, y: 0, z: 29.5 },
			{ x: 38.5, y: 0, z: 29.5 },
		],
	}, // 36
	{
		x: 31.5,
		y: 0,
		z: 27.5,
		quadraticPath: [
			{ x: 38.5, y: 0, z: 29.5 },
			{ x: 31.5, y: 0, z: 29.5 },
			{ x: 31.5, y: 0, z: 27.5 },
		],
	}, // 37
	{
		x: 25,
		y: 0,
		z: 22.5,
		quadraticPath: [
			{ x: 31.5, y: 0, z: 27.5 },
			{ x: 31.5, y: 0, z: 22.5 },
			{ x: 25, y: 0, z: 22.5 },
		],
	}, // 38
	{
		x: 20,
		y: 0,
		z: 35,
		quadraticPath: [
			{ x: 25, y: 0, z: 22.5 },
			{ x: 20, y: 0, z: 22.5 },
			{ x: 20, y: 0, z: 35 },
		],
		parkTo: 34
	}, // 39
	{ x: 20, y: 0, z: 39.5, parkTo: 35 }, // 40
	{ x: 20, y: 0, z: 44.5, parkTo: 36 }, // 41
	{ x: 20, y: 0, z: 50, parkTo: 37 }, // 42
	{ x: 20, y: 0, z: 54.5, parkTo: 38 }, // 43
	{ x: 20, y: 0, z: 59.5, parkTo: 39 }, // 44
	{ x: 20, y: 0, z: 65, parkTo: 40 }, // 45
	{ x: 20, y: 0, z: 69.5, parkTo: 41 }, // 46
	{ x: 20, y: 0, z: 74.5, parkTo: 42 }, // 47
	{ x: 20, y: 0, z: 80, parkTo: 43 }, // 48
	{ x: 20, y: 0, z: 84.5, parkTo: 44 }, // 49
	{ x: 20, y: 0, z: 89.5, parkTo: 45 }, // 50
	{
		x: 20,
		y: 0,
		z: 96,
		parkTo: 46
	}, // 51
	{
		x: 20,
		y: 0,
		z: 102,
		parkTo: 47
	}, // 52
	{
		x: 20,
		y: 0,
		z: 109,
		parkTo: 48
	}, // 53
	{
		x: 20,
		y: 0,
		z: 114.5,
	}, // 54
	{
		x: 20,
		y: 0,
		z: 119,
	}, // 55
	{
		x: 28,
		y: 0,
		z: 121,
		quadraticPath: [
			{
				x: 20,
				y: 0,
				z: 119,
			},
			{
				x: 20,
				y: 0,
				z: 121,
			},
			{
				x: 28,
				y: 0,
				z: 121,
			},
		],
	}, // 56
	{
		x: 42.5,
		y: 0,
		z: 121,
	}, // 57
];

export default path;
